app/controllers/folders_controller.rb

  def create
    @folder = Folder.new(name: params["folder_name"])

    if @folder.save
---
INSERT INTO "folders" ("created_at", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-08-22 14:05:14.901537"], ["name", "Sports"], ["updated_at", "2014-08-22 14:05:14.901537"], ["user_id", 2]]

  def destroy
    @folder.destroy
---
DELETE FROM "folders" WHERE "folders"."id" = $1  [["id", 61]]

  def users_folders
    user = User.find(current_user.id)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]

  def set_folder
    @folder = Folder.find(params[:id])
---
SELECT  "folders".* FROM "folders"  WHERE "folders"."id" = $1 LIMIT 1  [["id", 61]]