app/controllers/links_controller.rb

INSERT INTO "links" ("created_at", "updated_at", "url") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-08-25 20:21:06.513109"], ["updated_at", "2014-08-25 20:21:06.513109"], ["url", "http://games.espn.go.com/ffl/clubhouse?leagueId=650670&teamId=1&seasonId=2014"]]
INSERT INTO "folder_links" ("created_at", "folder_id", "link_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-08-25 20:21:06.525060"], ["folder_id", 1], ["link_id", 1], ["updated_at", "2014-08-25 20:21:06.525060"]]
---
  def new_link
    link = Link.find_by_url(params["url"])

    if link == nil
      link = Link.create(url: params["url"],
                        title: params["pageInfo"]["title"],
                        description: params["pageInfo"]["description"],
                        image: params["pageInfo"]["image"])
    end

    FolderLink.create(link_id: link.id,
                        folder_id: params["uniqueId"])