app/controllers/sessions_controller.rb

  def create
    user = User.from_omniauth(env["omniauth.auth"])
    session[:user_id] = user.id

    if SharedBasket.where(user_id: user.id).first == nil
      SharedBasket.where(user_id: user.id).create
      Folder.where(name: "Read Later", user_id: user.id).first_or_create
---
SELECT  "shared_baskets".* FROM "shared_baskets"  WHERE "shared_baskets"."user_id" = 1  ORDER BY "shared_baskets"."id" ASC LIMIT 1
INSERT INTO "shared_baskets" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-08-24 20:47:06.015560"], ["updated_at", "2014-08-24 20:47:06.015560"], ["user_id", 1]]
INSERT INTO "users" ("created_at", "email", "image", "name", "oauth_expires_at", "oauth_token", "provider", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "folders" ("created_at", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-08-22 13:18:23.395262"], ["name", "Shared"], ["updated_at", "2014-08-22 13:18:23.395262"], ["user_id", 1]]
SELECT  "folders".* FROM "folders"  WHERE "folders"."user_id" = 1 AND "folders"."name" = 'Shared'  ORDER BY "folders"."id" ASC LIMIT 1