app/controllers/shared_baskets_controller.rb

SELECT  "shared_baskets".* FROM "shared_baskets"  WHERE "shared_baskets"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    shared_basket = SharedBasket.find(params[:id])