app/controllers/shared_links_controller.rb

  def sent_link
    friend_id = params["friendId"].to_i
    shared_basket = SharedBasket.find(friend_id)

    #include the new info being sent in from the extension
    shared_basket.shared_links.create(sender_id: current_user.id,
                                      url: params["url"],
                                      title:,
                                      description:,
                                      image: )
---
SELECT  "shared_baskets".* FROM "shared_baskets"  WHERE "shared_baskets"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "shared_links" ("created_at", "sender_id", "shared_basket_id", "updated_at", "url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"